IT IS A TECHNIQUE USED TO ENCODE CATEGORICAL VARIABLES BASED ON THEIR RELATIONSHIP WITH THE TARGET VARIABLE.
THIS ENCODING IS USEFUL WHEN WE HHAVE A LARGE UNIQUE CATEGORIES.

IN TARGET GUIDED ENCODING WE REPLACE EACH CATEGORY IN THE CATEGORICAL VARIABLE WITH A NUMERICAL VALUE BASED 
ON THE MEAN AND MEDIAN OF THE TARGET VARIABLE FOR THAT CATEGORY. THIS CREATES A MONOTONIC RELATIONSHIP
BETWEEN CATEGORICAL AND TARGET VARIABLE, WHICH IMPROVE THE PREDICTIVE POWER.

In [2]:
import pandas as pd
df = pd.DataFrame({ 
    'city' : ['newyork', 'london' ,'paris', 'tokyo' ,'paris','newyork'],
    'price' : [200,150,300,250,180,320]
})

In [3]:
df.head()

      city  price
0  newyork    200
1   london    150
2    paris    300
3    tokyo    250
4    paris    180

In [4]:
## mean price calculate foor each cit

In [8]:
mean_price = df.groupby("city")['price'].mean()

In [9]:
mean_price

city
london     150.0
newyork    260.0
paris      240.0
tokyo      250.0
Name: price, dtype: float64

In [7]:
## replace each city with its mean price

In [10]:
df['city_encoded'] = df['city'].map(mean_price)

In [11]:
df

      city  price  city_encoded
0  newyork    200         260.0
1   london    150         150.0
2    paris    300         240.0
3    tokyo    250         250.0
4    paris    180         240.0
5  newyork    320         260.0

In [12]:
import seaborn as sns

In [14]:
df = sns.load_dataset('tips')

In [15]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]